Semaine6/projet_de_la_semaine/the-gossip-project/app/views/welcome/index.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
---
      <p class="card-text">"<%= "#{gossip.content[0...100]}..." %>"</p>
      <p class="card-link">de <%= link_to "#{User.find(gossip.user_id).first_name} #{User.find(gossip.user_id).last_name}",author_path(gossip.user_id) %></p>