Semaine6/corrections/xav/GossipV25545345313/app/models/comment.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
---
  def author
    User.find(self.user_id).first_name