Semaine6/corrections/xav/GossipV25545345313/app/controllers/application_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 21], ["LIMIT", 1]]
---
    def set_current_user
        if session[:user_id]
            Current.user = User.find_by(id: session[:user_id])