Semaine6/corrections/xav/GossipV25545345313/app/controllers/gossips_controller.rb

SELECT "gossips".* FROM "gossips"
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 21], ["LIMIT", 1]]
---
  def index
    @gossips = Gossip.all
    if session[:user_id]
      # using find() would return an error if he can't find anything
      # so we use find_by instead, basicaly same process but not errors is return if the value is empty
      @user = User.find_by(id: session[:user_id])

SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
---
    def set_gossip
      @gossip = Gossip.find(params[:id])