Semaine6/corrections/xav/GossipV25545345313/app/controllers/likes_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 21], ["LIMIT", 1]]
SELECT  1 AS one FROM "likes" WHERE "likes"."user_id" = $1 AND "likes"."gossip_id" = $2 LIMIT $3  [["user_id", 21], ["gossip_id", 2], ["LIMIT", 1]]
INSERT INTO "likes" ("gossip_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["gossip_id", 2], ["user_id", 21], ["created_at", "2021-08-05 21:23:33.730781"], ["updated_at", "2021-08-05 21:23:33.730781"]]
---
  def create
    if Current.user.likes.where(gossip_id: @gossip.id).empty?
      @gossip.likes.create(user_id: Current.user.id)

DELETE FROM "likes" WHERE "likes"."id" = $1  [["id", 13]]
SELECT  "likes".* FROM "likes" WHERE "likes"."user_id" = $1 AND "likes"."gossip_id" = $2 ORDER BY "likes"."id" ASC LIMIT $3  [["user_id", 21], ["gossip_id", 2], ["LIMIT", 1]]
---
  def destroy
    if Current.user
    Current.user.likes.where(gossip_id: @gossip.id).first.destroy

SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def find_gossip
    @gossip = Gossip.find(params[:gossip_id])