Semaine6/projet_de_la_semaine/the-gossip-project/app/controllers/gossips_controller.rb

  def index
    @all_gossip = Gossip.all
---
SELECT "gossips".* FROM "gossips"

  def create
    @user = User.find(10)
    p params
    @gossip = Gossip.new(title:params[:gossip][:title], content:params[:gossip][:content], user_id:@user.id)
    if @gossip.save
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]
INSERT INTO "gossips" ("title", "content", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "fzefzezef"], ["content", "zefzeffzezef"], ["user_id", 11], ["created_at", "2021-08-03 18:42:24.776020"], ["updated_at", "2021-08-03 18:42:24.776020"]]