Semaine6/projet_de_la_semaine/the-gossip-project/app/controllers/welcome_controller.rb

SELECT "gossips".* FROM "gossips"
---
  def index
    @all_gossip = Gossip.all

SELECT  "users".* FROM "users" WHERE "users"."first_name" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["first_name", "Javier"], ["LIMIT", 1]]
---
  def landing_page
    @user = User.where(first_name:params[:first_name]).first