Semaine6/projet_de_la_semaine/the-gossip-project/app/views/gossips/show.html.erb

<p class = "gs"><%= @gossip.content %></p>
<p class="right gs">Créer le <%= @gossip.created_at.to_s(:db) %> par <%= link_to "#{@gossip.user.first_name} #{@gossip.user.last_name}", author_path(@gossip.user_id) %>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]