Semaine6/corrections/xav/GossipV25545345313/app/views/gossips/index.html.erb


<h2>Bienvenue <%= Current.user.first_name if Current.user%>!</h2>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 16], ["LIMIT", 1]]

            <h4><%=link_to gossip.title, gossip_path(gossip) %></h4>
            <p><em>written by <%= link_to gossip.user.first_name, user_path(gossip.user_id) %></em></p>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 16], ["LIMIT", 1]]