Semaine6/corrections/xav/GossipV25545345313/app/views/gossips/show.html.erb

<h1><%= @gossip.title%></h1>
<p>Written by <%= link_to "#{@gossip.user.first_name}", user_path(@gossip.user_id) %>  <em>(<%= link_to @gossip.user.city.name, city_path(@gossip.user.city)%>)</em></p>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]

  <% liked = false %>
    <% @gossip.likes.each do |like| %>
---
SELECT "likes".* FROM "likes" WHERE "likes"."gossip_id" = $1  [["gossip_id", 2]]


  <div class="bg-primary p-2 ps-3 pe-3 rounded-3"><%= Like.all.length %> </div>
---
SELECT "likes".* FROM "likes"

  <h2>Commentaires :</h2>
  <% @gossip.comments.each do |c| %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."gossip_id" = $1  [["gossip_id", 2]]