Semaine6/corrections/xav/GossipV25545345313/app/views/cities/show.html.erb


  <% @city.users.each do |user| %>
  <% user.gossips.each do |g| %>
      <p><%= link_to g.title, gossip_path(g)%></p>
      <% @likes += g.likes.length %>
---
SELECT "users".* FROM "users" WHERE "users"."city_id" = $1  [["city_id", 12]]
SELECT "gossips".* FROM "gossips" WHERE "gossips"."user_id" = $1  [["user_id", 12]]
SELECT "likes".* FROM "likes" WHERE "likes"."gossip_id" = $1  [["gossip_id", 3]]